## Central Alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.transport_lambda_error[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "transport_lambda_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/CbsTransportLambda"
      + name           = "TransportLambdaErrorLogged"
      + pattern        = "ERROR"

      + metric_transformation {
          + name      = "TransportLambdaErrorLogged"
          + namespace = "CloudBasedSensor"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.no_transport_lambda_logs[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "no_transport_lambda_logs" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "CBS Transport lambda is sending logs to CCCS over a 10 minute period"
      + alarm_name                            = "NoTransportLambdaNoLogs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "LogGroupName" = "/aws/lambda/CbsTransportLambda"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "IncomingLogEvents"
      + namespace                             = "AWS/Logs"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.transport_lambda_error[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "transport_lambda_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Errors logged by the CBS transport lambda"
      + alarm_name                            = "TransportLambdaErrorLogged"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "TransportLambdaErrorLogged"
      + namespace                             = "CloudBasedSensor"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_kms_key.sns_cloudwatch will be created
  + resource "aws_kms_key" "sns_cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::871282759583:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "cbs-871282759583"
          + "Product"    = "cloud-based-sensor"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cbs-871282759583"
          + "Product"    = "cloud-based-sensor"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.cloudwatch_alarm will be created
  + resource "aws_sns_topic" "cloudwatch_alarm" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cbs-cloudwatch-alarm"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic_subscription.cloudwatch_alarm will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alarm" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:871282759583:function:cbs-notify-slack"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:871282759583:cbs-cloudwatch-alarm"
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] must be replaced
-/+ resource "aws_lambda_permission" "notify_slack" {
      ~ id            = "AllowExecutionFromSNS-cbs-notify-slack-0" -> (known after apply)
      ~ source_arn    = "arn:aws:sns:us-east-1:871282759583:cbs-cloudwatch-alarm" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[1] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action        = "lambda:InvokeFunction"
      + function_name = "cbs-notify-slack"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = "arn:aws:sns:us-east-1:871282759583:cbs-cloudwatch-alarm"
      + statement_id  = "AllowExecutionFromSNS-cbs-notify-slack-1"
    }

Plan: 8 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.billing_change_over_threshold"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.no_transport_lambda_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.transport_lambda_error[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_lambda_function.notify_slack"]

24 tests, 17 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
